base/Catalogs/бит_ПользовательскиеУсловия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеУсловия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодУсловия</Name>
					<Comment>Код условия на внутреннем языке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстВыполнения</Name>
					<Comment>Контекст выполнения пользовательского условия</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_КонтекстыВыполненияПользовательскихУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Comment>Алгоритм</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПользовательскогоУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыПользовательскихУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкобкаНачало</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>Вид сравнения</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыСравненияТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкобкаКонец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединениеСПоследующим</Name>
							<Comment>Объединение с последующим</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ТипыОбъединенияУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Comment>Это выражение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыУсловий</Name>
					<Comment>Параметры условий</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИД_Условия</Name>
							<Comment>Идентификатор условия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>Вид сравнения</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыСравненияТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
					<Comment>Дополнительные параметры</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолеваяАдресация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольИсполнителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСписковУсловий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыСравненияТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыСравненияТрансляции</Name>
			<Comment>Виды сравнения трансляции</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВГруппе</Name>
					<Comment>В группе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НЕВГруппе</Name>
					<Comment>НЕ в группе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСодержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВГруппеИзСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВГруппеИзСписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_КонтекстыВыполненияПользовательскихУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_КонтекстыВыполненияПользовательскихУсловий</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекущийОбъект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущийОбъект_ТекущаяВиза</Name>
					<Comment>Текущий объект &amp; Текущая виза</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущийОбъект_УстановленныеВизы</Name>
					<Comment>Текущий объект &amp; Установленные визы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процесс</Name>
					<Comment>Процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_ПользовательскиеУсловия/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов.
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов.
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда 		
		Возврат;    		
	КонецЕсли; 
	
	АктуализироватьПредставлениеКода(Объект);
	ЗагрузитьСписокОбъектов();
	ЗаполнитьДеревоУсловий();
	
	УстановитьУсловноеОформление();
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	АктуализироватьПредставлениеКода(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ПеренестиДанныеФормыВОбъект(ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтекстВыполненияПриИзменении(Элемент)
	
	КонтекстВыполненияИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовПриИзменении(Элемент)
	
	СохранитьСписокОбъектов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДоступныеВидыОбъектов = Новый СписокЗначений;
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник"));
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Задача"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокОбъектов",                СписокОбъектов);
	ПараметрыФормы.Вставить("ДоступныеВидыОбъектов",         ДоступныеВидыОбъектов);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",            Истина);
	ОткрытьФорму("Справочник.бит_ПользовательскиеУсловия.Форма.ВыборОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольноеУсловиеПриИзменении(Элемент)
	
	ПроизвольноеУсловиеИзменение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоУсловия

&НаКлиенте
Процедура ДеревоУсловияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекущаяСтрока = Элементы.ДеревоУсловия.ТекущиеДанные;	
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		
		// Всегда добавляем строку дерева верхнего уровня и добавляем соответствующую строку табличной части Условия.
		КоллекцияСтрок = ДеревоУсловия.ПолучитьЭлементы();
		НоваяСтрокаДерева              = КоллекцияСтрок.Добавить();
		НоваяСтрокаДерева.ВидСтроки    = "Условие";
		НоваяСтрокаДерева.ИД           = Строка(Новый УникальныйИдентификатор());
		НоваяСтрокаДерева.ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.Равно");
		
		НоваяСтрокаТаблицы          = Объект.Условия.Добавить();
		НоваяСтрокаТаблицы.ИД       = НоваяСтрокаДерева.ИД;
		
		Элементы.ДеревоУсловия.ТекущаяСтрока  = НоваяСтрокаДерева.ПолучитьИдентификатор();
		Элементы.ДеревоУсловия.ТекущийЭлемент = Элементы.ДеревоУсловияСвойство;
		
		Элементы.ДеревоУсловия.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	Иначе
		Если ТекущаяСтрока.ВидСтроки = "Параметр"
			ИЛИ ТекущаяСтрока.ПолучитьЭлементы().Количество() > 1 Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		// При копировании назначим новые ИД и создадим необходимые строки в таблицах.
		ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
		
		ТекущиеДанные.ИД   = Строка(Новый УникальныйИдентификатор());
		НоваяСтрокаТаблицы = Объект.Условия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы,ТекущиеДанные);
		
		Для каждого СтрокаДерева Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		    СтрокаДерева.ИД               = ТекущиеДанные.ИД;
			
			НоваяСтрокаТаблицы              = Объект.ПараметрыУсловий.Добавить();
			НоваяСтрокаТаблицы.ИД_Условия   = СтрокаДерева.ИД;
			НоваяСтрокаТаблицы.Имя          = СтрокаДерева.Свойство;
			НоваяСтрокаТаблицы.Значение     = СтрокаДерева.Значение;
			НоваяСтрокаТаблицы.ВидСравнения = СтрокаДерева.ВидСравнения;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ДеревоУсловияЗначение.ВыбиратьТип = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидСтроки = "Параметр" Тогда
		Отказ = Истина;
	Иначе
		ИдентификаторУдалемогоУсловия = ТекущиеДанные.ИД;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияПослеУдаления(Элемент)
	
	Если ПустаяСтрока(ИдентификаторУдалемогоУсловия) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИД", ИдентификаторУдалемогоУсловия);
	МассивСтрок = Объект.Условия.НайтиСтроки(Отбор);
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл
		Объект.Условия.Удалить(СтрокаТаблицы);
	КонецЦикла; 	
		
	Отбор = Новый Структура("ИД_Условия", ИдентификаторУдалемогоУсловия);	
	МассивСтрок = Объект.ПараметрыУсловий.НайтиСтроки(Отбор);
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл
		Объект.ПараметрыУсловий.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	Отбор = Новый Структура("ИдентификаторУсловия", ИдентификаторУдалемогоУсловия);	
	МассивСтрок = Объект.ЗначенияСписковУсловий.НайтиСтроки(Отбор);
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл
		Объект.ЗначенияСписковУсловий.Удалить(СтрокаТаблицы);
	КонецЦикла;
		
	ИдентификаторУдалемогоУсловия = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияСвойствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;

	Если ТекущиеДанные.ВидСтроки = "Условие" Тогда
		
		РежимКонструктора = ?(Объект.КонтекстВыполнения = ПредопределенноеЗначение("Перечисление.бит_КонтекстыВыполненияПользовательскихУсловий.Процесс")
					           , "ПользовательскоеУсловие_Процесс"
							   , "ПользовательскоеУсловие");
		
		// Откроем форму конструктора произвольного условия.
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОбъектыСистемы"         , СписокОбъектов);
		ПараметрыФормы.Вставить("ВидСравнения"           , ТекущиеДанные.ВидСравнения);
		ПараметрыФормы.Вставить("ЗначениеФильтра"        , ТекущиеДанные.Значение);
		ПараметрыФормы.Вставить("ТекущееЗначениеФильтра" , ТекущиеДанные.Значение);
		ПараметрыФормы.Вставить("ОбъединениеСПоследующим", ТекущиеДанные.ОбъединениеСПоследующим);
		ПараметрыФормы.Вставить("Условие"                , ТекущиеДанные.Свойство);
		ПараметрыФормы.Вставить("Режим"                  , РежимКонструктора);
		ПараметрыФормы.Вставить("КонтекстВыполненияУсловия", Объект.КонтекстВыполнения);
		ПараметрыФормы.Вставить("Алгоритм"                 , Объект.Алгоритм);
		
		Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыКонструкторПроизвольногоУсловия", ЭтотОбъект, ТекущиеДанные); 
		ОткрытьФорму("ОбщаяФорма.бит_КонструкторПроизвольногоУсловия", ПараметрыФормы, Элемент,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе	
	
		Элементы.ДеревоУсловия.Развернуть(ТекущиеДанные.ПолучитьИдентификатор(), Истина);
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияВидСравненияПриИзменении(Элемент, ПрограммнаяСменаЗначения = Ложь)
	
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	Если НЕ ПрограммнаяСменаЗначения И ТекущиеДанные.ВидСтроки <> "Условие" Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения     = ТипЗнч(ТекущиеДанные.Значение);
	ОжидаетсяСписок = ВидСравненияОбсуживаетСписок(ТекущиеДанные.ВидСравнения);
	Если ТипЗначения <> Тип("СписокЗначений") И ОжидаетсяСписок Тогда
		ЗначениеДоИзменения = ТекущиеДанные.Значение;
		НовоеЗначение       = Новый СписокЗначений;
		НовоеЗначение.Добавить(ЗначениеДоИзменения);
		ТекущиеДанные.Значение = НовоеЗначение;
	ИначеЕсли ТипЗначения = Тип("СписокЗначений") И НЕ ОжидаетсяСписок Тогда
		НовоеЗначение       = Неопределено;
		ЗначениеДоИзменения = ТекущиеДанные.Значение;
		Если ЗначениеДоИзменения.Количество() > 0 Тогда
			НовоеЗначение = ЗначениеДоИзменения[0].Значение;
		КонецЕсли;
		ТекущиеДанные.Значение = НовоеЗначение;
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Пользователи")
		И (ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВГруппе")
		 ИЛИ ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НЕВГруппе")) Тогда
		 ТекущиеДанные.Значение = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОграничитьВидыСравненияПоСтрокеУсловия(ТекущиеДанные, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

// Процедура окончание открытия формы бит_КонструкторПроизвольногоУсловияУправляемая.
// 
&НаКлиенте 
Процедура ЗакрытиеФормыКонструкторПроизвольногоУсловия(РезСтруктура, ТекущиеДанные) Экспорт
	
	Если НЕ РезСтруктура = Неопределено Тогда
		
		ТекущиеДанные.Свойство                = РезСтруктура.Условие;
		Если НЕ ТекущиеДанные.ЭтоВыражение Тогда
			
			ТекущиеДанные.ВидСравнения            = РезСтруктура.ВидСравнения;
			ТекущиеДанные.Значение                = РезСтруктура.Значение;
			ТекущиеДанные.ОбъединениеСПоследующим = РезСтруктура.ОбъединениеСПоследующим;
			
		КонецЕсли; 
		
		Если ИспользуютсяДополнительныеПараметрыУсловия(ТекущиеДанные) Тогда
			 // Очистка параметров, которые могли остаться от предыдущей функции
			 ТекущиеДанные.ПолучитьЭлементы().Очистить();
			 СтрОтбор = Новый Структура("ИД_Условия",ТекущиеДанные.Ид);
			 МассивОчистка = Объект.ПараметрыУсловий.НайтиСтроки(СтрОтбор);
			 Для каждого СтрокаУдалить Из МассивОчистка Цикл
			 
			 	Объект.ПараметрыУсловий.Удалить(СтрокаУдалить);
			 
			 КонецЦикла; 
			 
			 СписокДопПараметры = РезСтруктура.ДополнительныеПараметры;
			 Для каждого Элемент Из СписокДопПараметры Цикл
				 
				 СтрОтбор = Новый Структура("ИД_Условия,Имя",ТекущиеДанные.Ид,Элемент.Представление);
				 МассивСтрок = Объект.ПараметрыУсловий.НайтиСтроки(СтрОтбор);
				 Если МассивСтрок.Количество() > 0 Тогда
					 СтрокаПараметры          = МассивСтрок[0];
					 СтрокаПараметры.Значение = Элемент.Значение;
				 Иначе	
					 СтрокаПараметры                  = Объект.ПараметрыУсловий.Добавить();
					 СтрокаПараметры.ИД_Условия       = ТекущиеДанные.ИД;
					 СтрокаПараметры.Имя              = Элемент.Представление;
					 СтрокаПараметры.Значение         = Элемент.Значение;
					 СтрокаПараметры.ВидСравнения     = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.Равно"); 
				 КонецЕсли; // Нашли доп. параметр 
				 
				 СтрОтбор              = Новый Структура("ИД, Свойство, ВидСтроки", ТекущиеДанные.ИД, СтрокаПараметры.Имя, "Параметр");
				 СтрокаДереваПараметры = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(ТекущиеДанные.ПолучитьЭлементы(), СтрОтбор);
				 
				 Если СтрокаДереваПараметры = Неопределено Тогда
					 
					 СтрокаДереваПараметры = ТекущиеДанные.ПолучитьЭлементы().Добавить();
					 СтрокаДереваПараметры.ВидСтроки = "Параметр";
					 
				 КонецЕсли; 
				 
				 СтрокаДереваПараметры.ИД           = СтрокаПараметры.ИД_Условия;
				 СтрокаДереваПараметры.ВидСтроки    = "Параметр";												
				 СтрокаДереваПараметры.Свойство     = СтрокаПараметры.Имя;
				 СтрокаДереваПараметры.Значение     = СтрокаПараметры.Значение;
				 СтрокаДереваПараметры.ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.Равно");
				 
			 КонецЦикла; // По доп. параметрам
		
		КонецЕсли; 
		
		Элементы.ДеревоУсловия.Развернуть(ТекущиеДанные.ПолучитьИдентификатор(), Истина);
		
	КонецЕсли; // НЕ РезСтруктура = НЕОПРЕДЕЛЕНО

	УстановитьВидимостьСозданияОбработкиПроизвольногоАлгоритма();

КонецПроцедуры // ЗакрытиеФормыКонструкторПроизвольногоУсловия()

&НаКлиенте
Процедура ДеревоУсловияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	
	ОкончаниеРедактированияСтрокиДереваУсловий(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПривестиОграничениеТипаВыбираемогоЗначенияУсловия(Элемент);
	
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
		
	Если ТекущиеДанные.Значение = Неопределено Тогда
		Если НЕ Элемент.ВыбиратьТип Тогда
			
			СтандартнаяОбработка = Ложь;
			
			// Выберем чем заполнять
			СписокВыбора = Новый СписокЗначений;
			СписокВыбора.Добавить("Выражение");
			СписокВыбора.Добавить("Значение");
			
			ДопПараметры = Новый Структура("Элемент", Элемент);
			ОповещениеВыбора_ДеревоУсловияЗначения = Новый ОписаниеОповещения("ОповещениеВыбора_ДеревоУсловияЗначения", ЭтотОбъект, ДопПараметры);
			ПоказатьВыборИзСписка(ОповещениеВыбора_ДеревоУсловияЗначения, СписокВыбора, Элемент);
			
		КонецЕсли;
	ИначеЕсли ТекущиеДанные.ЭтоВыражение Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьКонструкторУсловия();
	Иначе
		Элемент.ВыбиратьТип = Ложь;
		ВыбратьЗначенияПараметровФункции(ТекущиеДанные, СтандартнаяОбработка, Элемент);
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ОповещениеВыбора_ДеревоУсловияЗначения".
// 
// Параметры:
// ВыбЗначение 	- Строка
// ДопПараметры - Структура
// 
&НаКлиенте
Процедура ОповещениеВыбора_ДеревоУсловияЗначения(ВыбЗначение, ДопПараметры) Экспорт

	Если ВыбЗначение <> Неопределено Тогда
		
		Если ВыбЗначение.Значение = "Выражение" Тогда
			
			ОткрытьКонструкторУсловия();
			
		ИначеЕсли ВыбЗначение.Значение = "Значение" Тогда
			
			ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
			Если ТекущиеДанные.Значение = Неопределено Тогда
				ТекущиеДанные.ЭтоВыражение 		 = Ложь;
				ДопПараметры.Элемент.ВыбиратьТип = Истина;
			КонецЕсли;
		
		КонецЕсли;	
		
	КонецЕсли;	

КонецПроцедуры // ОповещениеВыбора_ДеревоУсловияЗначения()

// Процедура открывает конструктор условия
//
&НаКлиенте
Процедура ОткрытьКонструкторУсловия()

	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	
	// Откроем форму конструктора произвольного условия
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектыСистемы", СписокОбъектов);
	ПараметрыФормы.Вставить("Условие",        ТекущиеДанные.Значение);
	ПараметрыФормы.Вставить("Режим",          "ПользовательскоеУсловие_Выражение");
	ПараметрыФормы.Вставить("КонтекстВыполненияУсловия", Объект.КонтекстВыполнения);
	
	РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ДопПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
	Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторУсловияЗавершение", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.бит_КонструкторПроизвольногоУсловия", ПараметрыФормы, ЭтотОбъект,,,,Оповещение, РежимОкна);
	
КонецПроцедуры // ОткрытьКонструкторУсловия()

// Процедура обработчик оповещения "ОткрытьКонструкторУсловияЗавершение".
// 
// Параметры:
// РезСтруктура - Структура
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ОткрытьКонструкторУсловияЗавершение(РезСтруктура, ДополнительныеДанные) Экспорт
	
	Если РезСтруктура <> Неопределено Тогда
		
		ДополнительныеДанные.ТекущиеДанные.Значение  = РезСтруктура.Условие;
		ДополнительныеДанные.ТекущиеДанные.ЭтоВыражение = Истина;
		
	КонецЕсли;				
	
КонецПроцедуры	// ОткрытьКонструкторУсловияЗавершение

&НаКлиенте
Процедура ДеревоУсловияЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	ТекущиеДанные.Значение = Неопределено;
	
	Элемент.ВыбиратьТип = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПривестиОграничениеТипаВыбираемогоЗначенияУсловия(Элемент)
	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов;
	
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		ИЛИ ТекущиеДанные.ЭтоВыражение Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКДанным = ТекущиеДанные.Свойство;
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Элемент.ОграничениеТипа = ОграничениеТипаДанныхДляЗначенияУсловия(ПутьКДанным);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОграничениеТипаДанныхДляЗначенияУсловия(ПутьКДанным)
	
	ТипыДанных         = Новый Массив;
	
	ПутиКДанным        = СтрРазделить(ПутьКДанным, ".", Ложь);
	ИсточникДанных     = ПутиКДанным[0];
	УровеньВложенности = 1;
	ЭтоУровеньЗначения = (ПутиКДанным.Количество() = УровеньВложенности);
	
	Если ИсточникДанных = "ТекущийОбъект" Тогда
		Для каждого ЭлементОбъекта Из СписокОбъектов Цикл
			ОбъектСистемы = ЭлементОбъекта.Значение;
			Если НЕ ЗначениеЗаполнено(ОбъектСистемы) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭтоУровеньЗначения Тогда
				ТипыДанных.Добавить(ОбъектСистемы.ТипЗначенияОбъекта.Получить());
			Иначе
				МетаданныеОбъекта = Справочники.бит_ОбъектыСистемы.ОбъектМетаданныхПоОбъектуСистемы(ОбъектСистемы);
				ДобавитьТипыДанныхДляЗначенияУсловия(ТипыДанных, ПутиКДанным, МетаданныеОбъекта, УровеньВложенности);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ИсточникДанных = "Статус" Тогда
		Если ЭтоУровеньЗначения Тогда
			ТипыДанных.Добавить(Тип("СправочникСсылка.бит_СтатусыОбъектов"));
		Иначе
			МетаданныеОбъекта = Метаданные.Справочники.бит_СтатусыОбъектов;
			ДобавитьТипыДанныхДляЗначенияУсловия(ТипыДанных, ПутиКДанным, МетаданныеОбъекта, УровеньВложенности);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов(ТипыДанных);
	
КонецФункции

&НаСервере
Процедура ДобавитьТипыДанныхДляЗначенияУсловия(ТипыДанных, ПутиКДанным, ТекущиеМетаданные, УровеньВложенности)
	
	ИмяРеквизита = ПутиКДанным[УровеньВложенности];
	Попытка
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита, ТекущиеМетаданные) Тогда
			МетаданныеРеквизита = ТекущиеМетаданные.Реквизиты[ИмяРеквизита];
		ИначеЕсли ОбщегоНазначения.ЭтоСтандартныйРеквизит(ТекущиеМетаданные.СтандартныеРеквизиты, ИмяРеквизита) Тогда
			МетаданныеРеквизита = ТекущиеМетаданные.СтандартныеРеквизиты[ИмяРеквизита];
		Иначе
			Возврат;
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;
	
	УровеньВложенности = УровеньВложенности + 1;
	ЭтоУровеньЗначения = (ПутиКДанным.Количество() = УровеньВложенности);
	
	ТипыРеквизита = МетаданныеРеквизита.Тип.Типы();
	Для каждого ТипРеквизита Из ТипыРеквизита Цикл
		Если ЭтоУровеньЗначения Тогда
			ТипыДанных.Добавить(ТипРеквизита);
		Иначе
			ТекущиеМетаданные = Метаданные.НайтиПоТипу(ТипРеквизита);
			Если ТекущиеМетаданные = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьТипыДанныхДляЗначенияУсловия(ТипыДанных, ПутиКДанным, ТекущиеМетаданные, УровеньВложенности);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура обеспечивает возможность выбора из списков параметров функции.
// 
// Параметры:
//  ТекущиеДанные - СтрокаДереваЗначений.
// 
&НаКлиенте
Процедура ВыбратьЗначенияПараметровФункции(ТекущиеДанные, СтандартнаяОбработка, Элемент)
	
	// Выбираем значения параметров функции	
	СписокДляВыбора = Неопределено;	
	Если ТекущиеДанные.Свойство = "ИмяТабЧасти" Тогда
		
		// Выбираем параметр "ИмяТабЧасти" функции ТабЧастьСодержитЗначение.
		СписокДляВыбора = ПодготовитьСписокВыбора("СписокТабЧастей");
		
	ИначеЕсли ТекущиеДанные.Свойство = "ИмяРеквизита" Тогда	   
		
		// Выбираем параметр "ИмяРеквизита" функции ТабЧастьСодержитЗначение.
		СтрОтбор = Новый Структура;
		СтрОтбор.Вставить("ИД",ТекущиеДанные.ИД);
		СтрОтбор.Вставить("Свойство","ИмяТабЧасти");
		
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		
		Если НЕ Родитель = Неопределено Тогда
			
			Если Найти(Родитель.Свойство, "ТабЧастьСодержитЗначение") > 0 Тогда
			
				ТекЭлемент = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(Родитель.ПолучитьЭлементы(), СтрОтбор);
				
				Если НЕ ТекЭлемент = Неопределено Тогда
					
					СписокДляВыбора = ПодготовитьСписокВыбора("СписокРеквизитовТабЧасти", ТекЭлемент.Значение);
					
				КонецЕсли;
				
			ИначеЕсли Найти(Родитель.Свойство, "ПозицияСодержитЗначение") > 0 Тогда	
				
					СписокДляВыбора = ПодготовитьСписокВыбора("СписокРеквизитовПозиции");
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
	Если СписокДляВыбора <> Неопределено Тогда
		СтандартнаяОбработка  = Ложь;
		НачальноеЗначение     = Неопределено;
		ЗначениеТекущихДанных = ТекущиеДанные.Значение;
		Если ЗначениеЗаполнено(ЗначениеТекущихДанных) Тогда
			Для каждого ЭлементСписка Из СписокДляВыбора Цикл
				Если ЭлементСписка.Представление = ЗначениеТекущихДанных Тогда
					НачальноеЗначение = ЭлементСписка;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ДопПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
		Оповещение   = Новый ОписаниеОповещения("ВыборПараметровФункцииЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВыборИзСписка(Оповещение, СписокДляВыбора,,НачальноеЗначение);
	ИначеЕсли ТипЗнч(ТекущиеДанные.Значение) = Тип("СправочникСсылка.бит_ТочкиАлгоритмов") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы       = Новый Структура;
		Отбор                = Новый Структура("Владелец", Объект.Алгоритм);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ОткрытьФорму("Справочник.бит_ТочкиАлгоритмов.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;
	
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыборПараметровФункцииЗавершение".
// 
// Параметры:
// ВыбранноеЗначение - ЭлементСпискаЗначений.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ВыборПараметровФункцииЗавершение(ВыбранноеЗначение, ДополнительныеДанные) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ДополнительныеДанные.ТекущиеДанные.Значение = ВыбранноеЗначение.Представление;
	
	Если ДополнительныеДанные.ТекущиеДанные.Свойство = "ИмяРеквизита" Тогда
		
		// Приведем тип значения параметра "Значение" функции ТабЧастьСодержитЗначение.
		СтрОтбор = Новый Структура;
		СтрОтбор.Вставить("ИД",ДополнительныеДанные.ТекущиеДанные.ИД);
		СтрОтбор.Вставить("Свойство","Значение");
		
		Родитель = ДополнительныеДанные.ТекущиеДанные.ПолучитьРодителя();
		
		Если НЕ Родитель = Неопределено Тогда
			
			ТекЭлемент = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(Родитель.ПолучитьЭлементы(), СтрОтбор);
			
			Если НЕ ТекЭлемент = Неопределено Тогда
				
				ТекЭлемент.Значение = ВыбранноеЗначение.Значение.ПривестиЗначение(ТекЭлемент.Значение);
				
			КонецЕсли; 
			
		КонецЕсли; // Родитель есть
		
	КонецЕсли;
	
КонецПроцедуры

// Функция готовит список выбора.
// 
// Параметры:
//   Режим - Строка
//   Параметр - Произвольный
// 
// Возвращаемое значение:
//  СписокДляВыбора - СписокЗначений.
// 
&НаСервере
Функция ПодготовитьСписокВыбора(Знач Режим, Знач Параметр = Неопределено)
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Если Режим = "СписокТабЧастей" Тогда
		
		СписокДляВыбора = Справочники.бит_ПользовательскиеУсловия.ОбщиеТабличныеЧастиСпискаОбъектов(СписокОбъектов);
		
	ИначеЕсли Режим = "СписокРеквизитовТабЧасти" Тогда
		
		// Параметр - Имя таб. части
		СписокДляВыбора = Справочники.бит_ПользовательскиеУсловия.ОбщиеРеквизитыТабличныхЧастей(СписокОбъектов, Параметр);
		
	ИначеЕсли Режим = "СписокРеквизитовПозиции" Тогда	
		
		СписокДляВыбора = Справочники.бит_ПользовательскиеУсловия.СформироватьСписокРеквизитовПозиции(СписокОбъектов);
	
	КонецЕсли; 
	
	Возврат СписокДляВыбора;
	
КонецФункции

&НаКлиенте
Процедура ДеревоУсловияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ДеревоУсловияВидСравнения"
		И ТекущиеДанные.Свойство = "Значение"
		И ЭтоСтрокаПараметрУсловия(ТекущиеДанные, "Прочее.ТабЧастьСодержитЗначение") Тогда
		ВыбратьВидСравненияЗначенияТабличнойЧасти(ТекущиеДанные, Элемент, СтандартнаяОбработка);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияПриАктивизацииСтроки(Элемент)
	
	УстановитьВидимостьСозданияОбработкиПроизвольногоАлгоритма();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	ПроверитьУсловие(Модифицированность);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьКод(Команда)
	
    ОбновитьКод();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНоваяОбработкаПодключаемогоАлгоритма(Команда)
	
	#Если ВебКлиент Тогда
		ВызватьИсключение НСтр("ru = 'Недоступно в веб-клиенте.'");
	#Иначе
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("НазначениеОбработки", "ТочкаУсловия");
		ОткрытьФорму("Справочник.бит_АлгоритмыПроцессов.Форма.СохранитьОбработкуПодключаемогоАлгоритма", ПараметрыОбработки);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасширеннаяПроверка(Команда)
	
	РасширеннаяПроверка = НЕ РасширеннаяПроверка;
	Элементы.ФормаКомандаРасширеннаяПроверка.Пометка = РасширеннаяПроверка;
	Элементы.ОбъектПроверки.Видимость                = РасширеннаяПроверка;
	Если НЕ РасширеннаяПроверка Тогда
		ОбъектПроверки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоУсловия");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ДеревоУсловия.ВидСтроки", ВидСравненияКомпоновкиДанных.Равно, "Параметр");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветФонаФиксированныхПараметров);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоУсловияСвойство");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоУсловияВидСравнения");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоУсловияОбъединениеСПоследующим");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ДеревоУсловия.ВидСтроки", ВидСравненияКомпоновкиДанных.Равно, "Параметр");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

// Процедура управляет видимостью/доступностью элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()
	
	ЭтоПроцесс = ?(Объект.КонтекстВыполнения = Перечисления.бит_КонтекстыВыполненияПользовательскихУсловий.Процесс, Истина, Ложь);
	
	Элементы.Алгоритм.Доступность       = ЭтоПроцесс;
	Элементы.СписокОбъектов.Доступность = НЕ ЭтоПроцесс;
	
КонецПроцедуры

// Процедура обрабатывает изменение контекста выполнения. 
// 
&НаСервере
Процедура КонтекстВыполненияИзменение()

	Если Объект.КонтекстВыполнения = Перечисления.бит_КонтекстыВыполненияПользовательскихУсловий.Процесс Тогда
		
		СписокОбъектов.Очистить();
		СписокОбъектов.Добавить(бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.БизнесПроцессы.бит_Процесс));
	
	КонецЕсли; 
	
 	УстановитьВидимость();

КонецПроцедуры

// Процедура обрабатывает изменение произвольного условия.
// 
&НаСервере
Процедура ПроизвольноеУсловиеИзменение()

	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Объект.КодУсловия = ТекущийОбъект.СформироватьТекстУсловия();
	АктуализироватьПредставлениеКода(Объект);

КонецПроцедуры

// Процедура переносит измененные значения списка объектов и условий в объект.
&НаСервере
Процедура ПеренестиДанныеФормыВОбъект(ТекущийОбъект)
	
	СохранитьСписокОбъектов(ТекущийОбъект);
	СохранитьЗначенияСписковУсловий(ТекущийОбъект);
	
	// Перенумеровываем строки дерева и при необходимости перенумеровываем связанные с ними строки табличной части
	// это необходимо для возможности изменения порядка строк в дереве.
	
	ТабВрем = ТекущийОбъект.Условия.Выгрузить();
	
	Сч = 1;
	КоллекцияВерх = ДеревоУсловия.ПолучитьЭлементы();
	
	Для каждого ТекСтрока Из КоллекцияВерх Цикл
	
		 ТекСтрока.НомерСтроки = Сч;
		 
		 СтрОтбор = Новый Структура;
		 СтрОтбор.Вставить("ИД", ТекСтрока.ИД);
		 
		 РезПоиска = ТабВрем.НайтиСтроки(СтрОтбор);
		 
		 Если РезПоиска.Количество() > 0 Тогда
		 
		 	 РезПоиска[0].НомерСтроки = ТекСтрока.НомерСтроки;
		 
		 КонецЕсли; 
		 
		 КоллекцияПараметры = ТекСтрока.ПолучитьЭлементы();
		 
		 Для каждого СтрокаПараметр Из КоллекцияПараметры Цикл
			 
			 СтрокаПараметр.НомерСтроки = Сч;
			 
			 СтрОтбор = Новый Структура;
			 СтрОтбор.Вставить("ИД", СтрокаПараметр.ИД);
			 
			 РезПоиска = ТабВрем.НайтиСтроки(СтрОтбор);
			 
			 Если РезПоиска.Количество() > 0 Тогда
				 
				 РезПоиска[0].НомерСтроки = СтрокаПараметр.НомерСтроки;
				 
			 КонецЕсли;
			 
		 КонецЦикла; 
		 
		 Сч = Сч+1;
	
	КонецЦикла; 
	
	ТабВрем.Сортировать("НомерСтроки");
	
	ТекущийОбъект.Условия.Загрузить(ТабВрем);
	
КонецПроцедуры

// Выполняет синтаксический контроль кода условия. 
// 
&НаСервере
Процедура ПроверитьУсловие(Знач ОбновитьКодУсловия)
	
	Если ОбновитьКодУсловия Тогда
		ПеренестиДанныеФормыВОбъект(Объект);
		ПроизвольноеУсловиеИзменение();
	КонецЕсли;
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.КодУсловия = ТекущийОбъект.СформироватьТекстУсловия();
	ТекущийОбъект.ПроверитьУсловие("Все",, ОбъектПроверки);

КонецПроцедуры // ПроверитьУсловие()

// Процедура обновляет код условия. 
// 
&НаСервере
Процедура ОбновитьКод()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Объект.КодУсловия = ТекущийОбъект.СформироватьТекстУсловия();
	
КонецПроцедуры

// Заполняет список объектов системы на основании данных табличной части
&НаСервере
Процедура ЗагрузитьСписокОбъектов()
	
	МассивОбъектов = Объект.ОбъектыСистемы.Выгрузить().ВыгрузитьКолонку("ОбъектСистемы");
	СписокОбъектов.ЗагрузитьЗначения(МассивОбъектов);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСписокОбъектов(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ОбъектыСистемы = Объект.ОбъектыСистемы;
	Иначе
		ОбъектыСистемы = ТекущийОбъект.ОбъектыСистемы;
	КонецЕсли;
		
	ОбъектыСистемы.Очистить();
	Для каждого ЭлементСписка Из СписокОбъектов Цикл
		СтрокаОбъекта = ОбъектыСистемы.Добавить();
		СтрокаОбъекта.ОбъектСистемы = ЭлементСписка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначенияСписковУсловий(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ЗначенияСписковУсловий = Объект.ЗначенияСписковУсловий;
	Иначе
		ЗначенияСписковУсловий = ТекущийОбъект.ЗначенияСписковУсловий;
	КонецЕсли;
	
	ЗначенияСписковУсловий.Очистить();
	КоллекцияУсловий = ДеревоУсловия.ПолучитьЭлементы();
	Для каждого СтрокаУсловия Из КоллекцияУсловий Цикл
		СохранитьЗначенияСписковУсловийПоСтроке(ЗначенияСписковУсловий, СтрокаУсловия);
		КоллекцияПараметров = СтрокаУсловия.ПолучитьЭлементы();
		Для каждого СтрокаПараметра Из КоллекцияПараметров Цикл
			СохранитьЗначенияСписковУсловийПоСтроке(ЗначенияСписковУсловий, СтрокаПараметра, Истина);
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначенияСписковУсловийПоСтроке(ЗначенияСписковУсловий, СтрокаУсловия, ЗначенияПараметра = Ложь)
	
	Если НЕ ВидСравненияОбсуживаетСписок(СтрокаУсловия.ВидСравнения) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияУсловия = СтрокаУсловия.Значение;
	Если ТипЗнч(ЗначенияУсловия) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторУсловия = СтрокаУсловия.ИД;
	Для каждого ЭлементСписка Из ЗначенияУсловия Цикл 
		СтрокаЗначенияСписка = ЗначенияСписковУсловий.Добавить();
		СтрокаЗначенияСписка.ИдентификаторУсловия = ИдентификаторУсловия;
		СтрокаЗначенияСписка.Значение             = ЭлементСписка.Значение;
		Если ЗначенияПараметра Тогда
			СтрокаЗначенияСписка.ИмяПараметра = СтрокаУсловия.Свойство;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет дерево условий по табличным частям условий и параметров.
// 
&НаСервере
Процедура ЗаполнитьДеревоУсловий()
	
	ДеревоУсловия.ПолучитьЭлементы().Очистить();
	СоответствиеСписков = Справочники.бит_ПользовательскиеУсловия.ЗначенияСписковУсловийПоИдентификаторам(Объект);
	ДеревоВрем          = РеквизитФормыВЗначение("ДеревоУсловия");
	
	Для каждого СтрокаТаблицы Из Объект.Условия Цикл
		ИдентификаторУсловия = СтрокаТаблицы.ИД;
		
		СтрокаДереваУсловия  = ДеревоВрем.Строки.Добавить();
		СтрокаДереваУсловия.ВидСтроки = "Условие";
		
		ЗаполнитьЗначенияСвойств(СтрокаДереваУсловия, СтрокаТаблицы);
		ЗначенияУсловия = СоответствиеСписков.Получить(ИдентификаторУсловия);
		Если ЗначенияУсловия <> Неопределено Тогда
			СтрокаДереваУсловия.Значение = ЗначенияУсловия;
		КонецЕсли;
		
		СтрОтбор = Новый Структура("ИД_Условия", ИдентификаторУсловия);
		
		МассивСтрокПараметров = Объект.ПараметрыУсловий.НайтиСтроки(СтрОтбор);
		
		Если МассивСтрокПараметров.Количество() > 0  Тогда
			
			Для каждого СтрокаПараметр Из МассивСтрокПараметров Цикл
				
				СтрокаДереваПараметр = СтрокаДереваУсловия.Строки.Добавить();
				СтрокаДереваПараметр.Свойство     = СтрокаПараметр.Имя;
				СтрокаДереваПараметр.ВидСравнения = ?(ЗначениеЗаполнено(СтрокаПараметр.ВидСравнения), СтрокаПараметр.ВидСравнения,
														Перечисления.бит_ВидыСравненияТрансляции.Равно);
				СтрокаДереваПараметр.ВидСтроки    = "Параметр";
				СтрокаДереваПараметр.ИД           = СтрокаПараметр.ИД_Условия;
				СтрокаДереваПараметр.Значение     = СтрокаПараметр.Значение;
				
				ИдентификаторПараметра = СтрШаблон("%1_%2", СокрЛП(СтрокаПараметр.Имя), ИдентификаторУсловия);
				ЗначенияПараметра = СоответствиеСписков.Получить(ИдентификаторПараметра);
				Если ЗначенияПараметра <> Неопределено Тогда
					СтрокаДереваПараметр.Значение = ЗначенияПараметра;
				КонецЕсли;
			КонецЦикла; // По параметрам условия
			
		КонецЕсли;// 
		
	КонецЦикла; // По таблице условий

	ЗначениеВДанныеФормы(ДеревоВрем, ДеревоУсловия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРедактированияСтрокиДереваУсловий(ТекущиеДанные)

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Синхронизируем значения в строках табличных частей и в дереве.
	Если ТекущиеДанные.ВидСтроки = "Параметр" Тогда
		
		СтрОтбор = Новый Структура("ИД_Условия,Имя",ТекущиеДанные.ИД,ТекущиеДанные.Свойство);
		
		МассивСтрок = Объект.ПараметрыУсловий.НайтиСтроки(СтрОтбор);
		
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаПараметры              = МассивСтрок[0];
			СтрокаПараметры.Значение     = ТекущиеДанные.Значение;
			СтрокаПараметры.ВидСравнения = ТекущиеДанные.ВидСравнения;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ТекущиеДанные.ВидСтроки = "Условие" Тогда
	
		СтрОтбор = Новый Структура("ИД",ТекущиеДанные.ИД);
		
		МассивСтрок = Объект.Условия.НайтиСтроки(СтрОтбор);
		
		Если МассивСтрок.Количество() > 0 Тогда
		
			 СтрокаУсловия = МассивСтрок[0];
			 ЗаполнитьЗначенияСвойств(СтрокаУсловия,ТекущиеДанные);
		
		КонецЕсли; 
	
	КонецЕсли; 


КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСозданияОбработкиПроизвольногоАлгоритма()
	
	Элементы.ДеревоУсловияКомандаНоваяОбработкаПодключаемогоАлгоритма.Видимость = Ложь;
	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДеревоУсловияКомандаНоваяОбработкаПодключаемогоАлгоритма.Видимость =
		(ТекущиеДанные.Свойство = "Прочее.ПодключаемыйАлгоритм");
	
КонецПроцедуры

&НаКлиенте
Функция ИспользуютсяДополнительныеПараметрыУсловия(СтрокаУсловия)
	
	ИмяСвойства = СтрокаУсловия.Свойство;
	
	Если Найти(ИмяСвойства, "УстановленныеВизы") > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрНачинаетсяС(ИмяСвойства, "ТекущаяЗадача.") Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИменаФункций = Новый Массив;
	ИменаФункций.Добавить("Прочее.ДоступнаРольИсполнителя");
	ИменаФункций.Добавить("Прочее.НазначеныИсполнители");
	ИменаФункций.Добавить("Прочее.ПозицияСодержитЗначение");
	ИменаФункций.Добавить("Прочее.ПозицияСодержитЗначениеВГруппе");
	ИменаФункций.Добавить("Прочее.СостояниеЗадачи");
	ИменаФункций.Добавить("Прочее.ТабЧастьСодержитЗначение");
	Если ИменаФункций.Найти(ИмяСвойства) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидСравненияОбсуживаетСписок(ВидСравнения)
	
	Если ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВСписке") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НеВСписке") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВГруппеИзСписка") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НеВГруппеИзСписка") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура АктуализироватьПредставлениеКода(ТекущийОбъект)
	
	КодУсловияСтрокой = Справочники.бит_ПользовательскиеУсловия.СформироватьПредставлениеКодаПользовательскогоУсловия(
							ТекущийОбъект.Условия, ТекущийОбъект.КодУсловия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьВидыСравненияПоСтрокеУсловия(СтрокаУсловия, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СтрокаУсловия.ВидСтроки <> "Условие" Тогда
		Возврат;
	КонецЕсли;
	
	ОграниченияВидовСравнения = Новый СписокЗначений;
	
	СвойствоУсловия = СтрокаУсловия.Свойство;
	
	СвойстваЧисловыхПроверок = Новый СписокЗначений;
	СвойстваЧисловыхПроверок.Добавить("ОплатаЗаявки.СуммаПлан");
	СвойстваЧисловыхПроверок.Добавить("ОплатаЗаявки.СуммаОплата");
	СвойстваЧисловыхПроверок.Добавить("ОплатаЗаявки.Разность");
	Если СвойстваЧисловыхПроверок.НайтиПоЗначению(СвойствоУсловия) <> Неопределено Тогда
		ОграниченияВидовСравнения.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.Равно"));
		ОграниченияВидовСравнения.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НеРавно"));
		ОграниченияВидовСравнения.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.Больше"));
		ОграниченияВидовСравнения.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.Меньше"));
		ОграниченияВидовСравнения.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.БольшеИлиРавно"));
		ОграниченияВидовСравнения.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.МеньшеИлиРавно"));
	КонецЕсли;
	
	СвойстваБулевыхПроверок = Новый СписокЗначений;
	СвойстваБулевыхПроверок.Добавить("Прочее.ТабЧастьСодержитЗначение");
	СвойстваБулевыхПроверок.Добавить("Прочее.ДоступнаРольИсполнителя");
	СвойстваБулевыхПроверок.Добавить("Прочее.НазначеныИсполнители");
	СвойстваБулевыхПроверок.Добавить("Прочее.ЕстьКорректировкаКонтрольныхЗначений");
	СвойстваБулевыхПроверок.Добавить("Прочее.ВключенаВРеестр");
	СвойстваБулевыхПроверок.Добавить("Прочее.ПодключаемыйАлгоритм");
	Если СвойстваБулевыхПроверок.НайтиПоЗначению(СвойствоУсловия) <> Неопределено Тогда
		ОграниченияВидовСравнения.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.Равно"));
		ОграниченияВидовСравнения.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НеРавно"));
	КонецЕсли;
	
	Если ОграниченияВидовСравнения.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора         = ОграниченияВидовСравнения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоСтрокаПараметрУсловия(ТекущаяСтрока, ПроверяемоеУсловие)
	
	Если ТекущаяСтрока.ВидСтроки <> "Параметр" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
	Если РодительСтроки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (РодительСтроки.Свойство = ПроверяемоеУсловие);
	
КонецФункции

&НаКлиенте
Процедура ВыбратьВидСравненияЗначенияТабличнойЧасти(ТекущаяСтрока, Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокДляВыбора = Новый СписокЗначений;
	СписокДляВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.Равно"));
	СписокДляВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВГруппе"));
	СписокДляВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВСписке"));
	СписокДляВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВГруппеИзСписка"));
	
	НачальноеЗначение = СписокДляВыбора.НайтиПоЗначению(ТекущаяСтрока.ВидСравнения);
	
	ДополнительныеПараметры = Новый Структура("ТекущиеДанные", ТекущаяСтрока);
	Оповещение              = Новый ОписаниеОповещения("ВыбратьВидСравненияЗначенияТабличнойЧастиЗавершение",
								ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзСписка(Оповещение, СписокДляВыбора, Элемент, НачальноеЗначение);
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыборПараметровФункцииЗавершение".
// 
// Параметры:
// ВыбранныйЭлемент - ЭлементСпискаЗначений.
// ДополнительныеПараметры - Структура.
// 
&НаКлиенте 
Процедура ВыбратьВидСравненияЗначенияТабличнойЧастиЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	ТекущиеДанные.ВидСравнения = ВыбранныйЭлемент.Значение;
	ДеревоУсловияВидСравненияПриИзменении(ТекущиеДанные, Истина);
	
КонецПроцедуры

#КонецОбласти
